The purpose of this function is to count the values or combination of values in an entire dataset or a subselection of the columns in a dataset. I have created this function because I couldn't find a pandas function that can count both missing and non-missing values while also looking at a combination of values (multiple columns)

In [69]:
import random
import string
import pandas as pd
import numpy as np
from IPython.display import display
# column names (optional) defined as string or list of strings
# Returns frequency table that includes missing values for df
def tidy_count(df,columns=None,count_col='n',return_df=False):
    # subset df by columns if specified
    if columns != None:
        if type(columns) != list:
            columns = [columns]
        df = df[columns]
        
    col_vals = df.columns.values # all column values
        
    # Find all distinct values in the dataset for both data values
    # and column names, store in the list allvals
    pds_allvals = pd.Series(col_vals) 
    for col in col_vals:
        pds_allvals = pd.concat([pds_allvals,cars[str(col)]]).drop_duplicates()
    allvals = pds_allvals.tolist()
    #print(allvals)
    
    filler_val=None
    # generate a random string for filler_val until it is 
    # not something that occurs in our data
    loop_iters=1
    while filler_val == None or filler_val in allvals:
        filler_val = ''.join(random.choices(string.digits + string.ascii_letters, k=np.random.randint(4,12)))  
        loop_iters += 1
        if loop_iters > 8:
            print('Error: Cannot find unique string to fill NA values.')
            break
        
    #print(filler_val)
    
    # reset count column name until it is unique among column names
    loop_iters=1
    while count_col in col_vals:
        if count_col == 'n':
            count_col = count_col + 'n'
        else:
            count_col = count_col + '_'
        
        if loop_iters > 8:
            print('Error: Cannot find unique string for counter column.')
            break    
        loop_iters += 1

     
    freq_table = df.fillna(filler_val).groupby([str(x) for x in col_vals]).size().\
            reset_index(name=count_col).\
         replace(filler_val,np.NaN).sort_values(count_col,ascending=False)
    
    if return_df == False:
        display(freq_table.style.hide_index())
    else:
        display(freq_table.style.hide_index())
        return(freq_table)

## Test

In [62]:
car_names = pd.DataFrame({'name' : ['Batmobile','Toyota Corolla','Bike','Bike','Batmobile'],
            'hp': [1000,120,np.nan,np.nan,900]})
car_attr = pd.DataFrame({"name": ["Bike","Toyota Corolla"], "color": ["blue","red"]})
cars = car_names.merge(car_attr,how='left',on='name')

In [65]:
a = tidy_count(cars,return_df=True)

In [66]:
a

             name      hp color  n
2            Bike     NaN  blue  2
0       Batmobile   900.0   NaN  1
1       Batmobile  1000.0   NaN  1
3  Toyota Corolla   120.0   red  1